Nutstore/rubyTest/backup/Shared_excel/app/controllers/stock_excels_controller.rb

SELECT  "stock_excels".* FROM "stock_excels"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
---
  def index
    @stock_excels=StockExcel.order('created_at DESC').paginate(:page => params[:excel_page], :per_page => 8)