app/controllers/homes_controller.rb

  def index
    @supplier_dbs=SupplierDb.filter(label_params).paginate(:page => params[:supplier_page],:per_page => 5)
    @supplier_labels=SupplierDb.label
    @repertory_dbs=RepertoryDb.paginate(:page => params[:repertory_page],:per_page => 18)
    @project_dbs=ProjectDb.paginate(:page => params[:project_page],:per_page => 6)
---
SELECT "supplier_dbs".* FROM "supplier_dbs"
SELECT  "repertory_dbs".* FROM "repertory_dbs" LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "repertory_dbs"
SELECT  "project_dbs".* FROM "project_dbs" LIMIT 7 OFFSET 0