app/controllers/mapping_dbs_controller.rb

  def index
    @mapping_dbs=MappingDb.search(search_params).paginate(:page => params[:mapping_page], :per_page => 12)
---
SELECT  "mapping_dbs".* FROM "mapping_dbs"  ORDER BY created_at desc LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "mapping_dbs"