app/controllers/mapping_excels_controller.rb

SELECT  "mapping_excels".* FROM "mapping_excels"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
---
  def index
    @mapping_excels=MappingExcel.paginate(:page => params[:excel_page], :per_page => 8).order('created_at DESC')