app/controllers/project_excels_controller.rb

SELECT  "project_excels".* FROM "project_excels"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
---
  def index
    @project_excels=ProjectExcel.paginate(:page => params[:excel_page], :per_page => 8).order('created_at DESC')