app/controllers/project_dbs_controller.rb

  def index
    @project_dbs=ProjectDb.search(search_params).paginate(:page => params[:page],:per_page => 17)
---
SELECT  "project_dbs".* FROM "project_dbs" WHERE (project_dbs.company LIKE '%%') AND (project_dbs.build_way LIKE '%%') AND (project_dbs.project_name LIKE '%%') AND (project_dbs.approve_time LIKE '%%')  ORDER BY created_at desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "project_dbs" WHERE (project_dbs.company LIKE '%%') AND (project_dbs.build_way LIKE '%%') AND (project_dbs.project_name LIKE '%%') AND (project_dbs.approve_time LIKE '%%')