app/controllers/repertory_excels_controller.rb

  def index
    @repertory_excels=RepertoryExcel.paginate(:page => params[:excel_page], :per_page => 8).order('created_at DESC')
    @repertory_dbs=RepertoryDb.paginate(:page => params[:repertory_page], :per_page => 6)
---
SELECT  "repertory_excels".* FROM "repertory_excels"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "repertory_dbs"