app/controllers/repertory_dbs_controller.rb

  def index
    if logged_in_visit?
      @repertory_dbs=RepertoryDb.filter_by_type(current_visit.supplier2).search(search_params).order('created_at desc').paginate(:page => params[:page], :per_page => 20)
---
SELECT  "repertory_dbs".* FROM "repertory_dbs" WHERE (repertory_dbs.name LIKE '%%') AND (repertory_dbs.standard LIKE '%%') AND (repertory_dbs.supplier LIKE '%%') AND (repertory_dbs.product_code LIKE '%%') AND (repertory_dbs.product_kind LIKE '%%') AND (repertory_dbs.model LIKE '%%')  ORDER BY created_at desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "repertory_dbs" WHERE (repertory_dbs.name LIKE '%%') AND (repertory_dbs.standard LIKE '%%') AND (repertory_dbs.supplier LIKE '%%') AND (repertory_dbs.product_code LIKE '%%') AND (repertory_dbs.product_kind LIKE '%%') AND (repertory_dbs.model LIKE '%%')

  def warning
    if logged_in_visit?
      @repertory_dbs=RepertoryDb.filter_by_num.filter_by_type(current_visit.supplier2).search(search_params).order('created_at desc').paginate(:page => params[:page], :per_page => 20)
---
SELECT  "repertory_dbs".* FROM "repertory_dbs" WHERE (repertory_dbs.num < repertory_dbs.warning) AND (repertory_dbs.name LIKE '%%') AND (repertory_dbs.standard LIKE '%%') AND (repertory_dbs.supplier LIKE '%%') AND (repertory_dbs.product_code LIKE '%%') AND (repertory_dbs.product_kind LIKE '%%') AND (repertory_dbs.model LIKE '%%')  ORDER BY created_at desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "repertory_dbs" WHERE (repertory_dbs.num < repertory_dbs.warning) AND (repertory_dbs.name LIKE '%%') AND (repertory_dbs.standard LIKE '%%') AND (repertory_dbs.supplier LIKE '%%') AND (repertory_dbs.product_code LIKE '%%') AND (repertory_dbs.product_kind LIKE '%%') AND (repertory_dbs.model LIKE '%%')

  def update
    @repertory_data = RepertoryDb.find_by_id(params[:id])
    @repertory_data.update_attributes(repertory_params)
---
SELECT  "repertory_dbs".* FROM "repertory_dbs" WHERE "repertory_dbs"."id" = $1 LIMIT 1  [["id", 82]]
UPDATE "repertory_dbs" SET "warning" = $1, "updated_at" = $2 WHERE "repertory_dbs"."id" = $3  [["warning", 5], ["updated_at", "2017-03-11 14:06:04.903435"], ["id", 82]]