app/controllers/stock_dbs_controller.rb

  def index
    @stock_dbs=StockDb.search(search_params).paginate(:page => params[:page],:per_page => 20)
---
SELECT  "stock_dbs".* FROM "stock_dbs" WHERE (stock_dbs.complete_time LIKE '%%') AND (stock_dbs.client_name LIKE '%%') AND (stock_dbs.product_name LIKE '%%') AND (stock_dbs.product_code LIKE '%%') AND (stock_dbs.standard LIKE '%%') AND (stock_dbs.kind LIKE '%%') AND (stock_dbs.project_name LIKE '%%') AND (stock_dbs.project_code LIKE '%%') AND (stock_dbs.supplier LIKE '%%')  ORDER BY created_at desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "stock_dbs" WHERE (stock_dbs.complete_time LIKE '%%') AND (stock_dbs.client_name LIKE '%%') AND (stock_dbs.product_name LIKE '%%') AND (stock_dbs.product_code LIKE '%%') AND (stock_dbs.standard LIKE '%%') AND (stock_dbs.kind LIKE '%%') AND (stock_dbs.project_name LIKE '%%') AND (stock_dbs.project_code LIKE '%%') AND (stock_dbs.supplier LIKE '%%')