app/controllers/stock_excels_controller.rb

  def index
    @stock_excels=StockExcel.paginate(:page => params[:stock_page], :per_page => 8).order('created_at DESC')
---
SELECT  "stock_excels".* FROM "stock_excels"  ORDER BY created_at DESC LIMIT 8 OFFSET 0