app/controllers/supplier_dbs_controller.rb

  def index
    @supplier_dbs=SupplierDb.search(search_params).paginate(:page => params[:page],:per_page => 20)
---
SELECT  "supplier_dbs".* FROM "supplier_dbs" WHERE (supplier_dbs.product LIKE '%%') AND (supplier_dbs.supplier LIKE '%%')  ORDER BY created_at desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "supplier_dbs" WHERE (supplier_dbs.product LIKE '%%') AND (supplier_dbs.supplier LIKE '%%')