app/controllers/supplier_excels_controller.rb

SELECT  "supplier_excels".* FROM "supplier_excels"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "supplier_dbs"
---
  def index
    @supplier_excels=SupplierExcel.paginate(:page => params[:excel_page], :per_page => 8).order('created_at DESC')
    @supplier_dbs=SupplierDb.filter(params[:label]).paginate(:page => params[:supplier_page], :per_page => 6)