app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE (hidden = 'f') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (hidden = 'f')
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @users=User.none_hidden_users.paginate(:page => params[:users_page], :per_page => 10)
    if !params[:user_id].blank?
      @user=User.find_by(id: params[:user_id].to_i)