app/views/layouts/_navside.html.erb

SELECT "users".* FROM "users" WHERE (hidden = 'f')
---
                所有用户
                <span class="label label-info pull-right"><%= User.none_hidden_users.length %></span>